import java.util.Scanner;
public class ExtremeIceCream {

	public static void main(String[] args) {
		/*1.Софтуера трябва да съдържа информация за броя на сладоледите които може да
		произведе за един ден.*/
		int maxDayProduction = 300;
		
	    /*Необходимо е да имаме информация за единичната цена, на която ще продаваме
		сладоледа, като за първа версия на продукта ще приемем че продаваме един вид
		сладолед и той има една цена.*/
		double iceCreamPrice = 2.15;
		
		/*3. Сладоледа който продаваме, си има закачлива име с което да се популяризира сред
		гладната му публика и то е “EXTREME ICE CREAME”, трябва да намерим начин да
		съхраняваме името на продукта, защото ще ни потрябва в даден момент.*/
		String iceCreamName = "EXTREME ICE CREAM";
		
		/*4. Производството на сладолед не е непрекъснат процес. През зимата хората избягват да
		пълнят торбите си със ледена наслада, затова трябва да намерим начин как да включваме
		и изключваме поточните линии.*/
		boolean isMachineOn = true;
		
		/*5. Сладоледа който продаваме си има идентификационен код, този код се състои от една
		буква + последователност от числа. Задължително трябва да знаем както буквата така и
		числото за да можем да водим счетоводството си правилно.*/
		char firstLetter = 'S';
		int mixedNumbers = 85467;
		
		/*6. Сладоледите ни се предоставят в 4 различни цвята (вкуса), необходимо е да имаме списък
		с тези цветове, от които да си избираме.*/
		String[] iceCreamFlavours = {"Blue", "Red", "Green", "Plain"};
		
		/*7. Планираме да създадем, специална рекламна кампания, за нашите фенове, въведете
		вашето име и ще получите специално съобщение от нашите спонсори. Ама как ще стане
		това ?*/ 
		Scanner inputName = new Scanner(System.in);
		
		System.out.println("Продукт: " + iceCreamName);
		System.out.println("Продажби за деня: " + maxDayProduction);
		System.out.println("Единична цена: " + iceCreamPrice + "лв");
		System.out.println("Продуктов код: " + firstLetter + "_" + mixedNumbers);
		System.out.println("Най-продаван цвят: " + iceCreamFlavours[2]);
		
		System.out.println("Въведете своето име:");
		String clientName = inputName.nextLine();
		System.out.println("Здравейте, " + clientName);
		

	}

}
