package homework4;

import java.util.Scanner;

public class AppLogic {
	public static void appLoader(int choice) {
		if(choice == 1) {
			Separator.ShowApp();
		}
		else if(choice == 2) {
			ReverseInt.ShowApp();		
		}
		else if(choice == 3) {
			NumCheck.ShowApp();			
		}
		else if(choice == 4) {
			TempConvert.ShowApp();
		}
		else if(choice == 5) {
			Rounder.ShowApp();
		}
		else if(choice == 6) {
			LeapYear.ShowApp();
		}
		else if(choice == 7) {
			CheckTriangle.ShowApp();
		}
		else if(choice == 8) {
			SwapValues.ShowApp();
		}
		
	}
	
	public static void showStart() {		
		Cons.Say("Изберете задача от домашното:");
		
		Cons.Say("1. Напишете програма, която “отделя” цифрите на четирицифрено число и ги принтира\r\n"
				+ "наобратно (от дясно на ляво).");
		
		Cons.Say("2. Напишете програма, която “обръща” едно четирицифрено число (например от 1234\r\n"
				+ "генерира числото 4321) и проверява кое от двете числа е по-голямо.\r\n"
				+ "Пример 1: За числото 3219, трябва да генерираме 9123 и да изведем 9123, защото е поголямо от 3219.\r\n"
				+ "Пример 2: За числото 3211, трябва да генерираме 1123 и да изведем 3211, защото е поголямо от 1123.");
		
		Cons.Say("3. Напишете програма, която проверява дали едно число е по-голямо от 0. Ако условието е\r\n"
				+ "изпълнено, умножете го по 10, ако е равно на 0, извадете от него 10, а в протвен случай,\r\n"
				+ "разделете с 10.");
		
		Cons.Say("4. Напишете програма, която приема число от клавиатурата, да го наречем type. Въведете\r\n"
				+ "още едно число - температура. Ако числото е 1, конвертирайте температурата от Целзий\r\n"
				+ "във Фаренхайт. В противен случай конвертирайте от Фаренхайт в Целзий.");
		
		Cons.Say("5. Напишете програма, която отпечатва 3-тото число след десетичната запетая от десетично\r\n"
				+ "число. Пример: 123.45678\r\n");
		
		Cons.Say("6. Да се напише програма, която проверява дали една година е високосна. На променливата\r\n"
				+ "isLeapYear да се присвои стойността на годината, ако тя е високосна, в противен случай на\r\n"
				+ "променливата isLeapYear да се присвои стойност -1.");
		
		Cons.Say("7. Да се веведат 3 страни на тригълник, да се декларира булева променлива isTriangle, която\r\n"
				+ "получава стойност true, ако може да съществува такъв тригълник и false в противен случай.");
		
		Cons.Say("8. Да се разменят стойностите на две цели числа. Не използвайте временна променлива");
		
		int choice = Cons.Get();
		appLoader(choice);
	}
	
	public static int askTester() {
		Cons.Say("\r\n\r\nМоля изберете как да продължите!");
		Cons.Say("[1] Изпълни програмата отново");
		Cons.Say("[2] Върни се в началото");
		
		return Cons.Get();
	}

}
